InformationRegisters/ВозвращенныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВозвращенныеДокументы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОригиналыПолучены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НетПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НасУстраивает</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Коробка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоробкиХраненияДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НеАктуально</Name>
					<Comment>Признак того, что возвращенный документ более не актуален</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыОбменаЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОбменаЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПодписания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПодписанияАннулирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовкаАннулирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаАннулирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ВозвращенныеДокументы/Ext/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
//+Белов А. 21.11.2024 # UT10-4928

	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если Не Запись.Коробка <> Справочники.КоробкиХраненияДокументов.КоробкаЭДО Тогда
			Продолжить;	
		КонецЕсли;  
		
		Если Не ЗначениеЗаполнено(Запись.Документ) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураЗаписи = Новый Структура;
		СтруктураЗаписи.Вставить("Статус", Перечисления.СтатусыОбменаЭДО.Завершен);
		СтруктураЗаписи.Вставить("Период", Запись.ДатаПолучения);
		СтруктураЗаписи.Вставить("Ошибка", "");            
		
		Комментарий = "";
		
		Комментарий = Комментарий + "Коробка: " + Строка(Запись.Коробка);
		Комментарий = Комментарий + Символы.ПС + "№ пп: " + Строка(Запись.НомерПоПорядку);    
		Комментарий = Комментарий + Символы.ПС + "ФИО получателя: " + Запись.ФИО;
		Комментарий = Комментарий + Символы.ПС + "Дата получения: " + Строка(Запись.ДатаПолучения);
		Комментарий = Комментарий + Символы.ПС + "Дата последнего изменения: " + Строка(Запись.ДатаПоследнегоИзменения);
		Комментарий = Комментарий + Символы.ПС + "Сумма документа: " + Строка(Запись.СуммаДокумента);
		Комментарий = Комментарий + Символы.ПС + "Оригиналы получены: " + Строка(Запись.ОригиналыПолучены);
		Комментарий = Комментарий + Символы.ПС + "Ошибка оформления: " + Строка(Запись.НетПечати);
		Комментарий = Комментарий + Символы.ПС + "Не актуально: " + Строка(Запись.НеАктуально);
		
		СтруктураЗаписи.Вставить("Комментарий", Комментарий);
		
		AMQP_РаботаСДокументами_ver2.СформироватьСообщениеСостояниеЭДО(Запись.Документ, СтруктураЗаписи);
		
	КонецЦикла;

//-Белов А. 21.11.2024 # UT10-4928	
КонецПроцедуры
